In [1]:
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
import sklearn.linear_model

# ignore warnings
import warnings
warnings.filterwarnings("ignore")


import matplotlib.pyplot as plt
import seaborn as sns


import acquire
import prepare

In [3]:
df = acquire.get_titanic_data()
df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [5]:
df = df.drop(columns='Unnamed: 0')

In [7]:
train, validate, test = prepare.prep_titanic_data(df)

In [9]:
train['baseline'] = train.survived.mode()[0]

In [10]:
train.head()

,survived,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton,baseline
583,0,1,36.000000,0,0,40.1250,1,1,0,0,0
165,1,3,9.000000,0,2,20.5250,0,1,0,1,0
50,0,3,7.000000,4,1,39.6875,0,1,0,1,0
259,1,2,50.000000,0,1,26.0000,0,0,0,1,0
306,1,1,29.678105,0,0,110.8833,1,0,0,0,0

Create a model that includes only age, fare, and pclass. Does this model perform better than your baseline?

In [12]:
train.head()

,survived,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton,baseline
583,0,1,36.000000,0,0,40.1250,1,1,0,0,0
165,1,3,9.000000,0,2,20.5250,0,1,0,1,0
50,0,3,7.000000,4,1,39.6875,0,1,0,1,0
259,1,2,50.000000,0,1,26.0000,0,0,0,1,0
306,1,1,29.678105,0,0,110.8833,1,0,0,0,0

In [13]:
X_train = train.drop(columns=['survived','sibsp','parch','alone','sex_male','embark_town_Queenstown','embark_town_Southampton','baseline'])
y_train = train.survived

X_validate = validate.drop(columns=['survived','sibsp','parch','alone','sex_male','embark_town_Queenstown','embark_town_Southampton'])
y_validate = validate.survived

X_test = test.drop(columns=['survived','sibsp','parch','alone','sex_male','embark_town_Queenstown','embark_town_Southampton'])
y_test = test.survived

In [14]:
train['baseline'] = train.survived.mode()[0]

In [15]:
baseline_accuracy = (train.survived == 0).mean()
round(baseline_accuracy, 2)

0.62

In [22]:
# initialize the model
logit = LogisticRegression(random_state=123)


logit.fit(X_train, y_train)


y_pred = logit.predict(X_train)

print("Baseline accuracy is", round(baseline_accuracy, 2))
print('Training accuracy: {:.2f}'
     .format(logit.score(X_train, y_train)))

Baseline accuracy is 0.62
Training accuracy: 0.81

Include sex in your model as well. Note that you'll need to encode or create a dummy variable of this feature before including it in a model.

In [34]:
X_train = train.drop(columns=['survived','sibsp','parch','alone','embark_town_Queenstown','embark_town_Southampton','baseline'])
y_train = train.survived

X_validate = validate.drop(columns=['survived','sibsp','parch','alone','embark_town_Queenstown','embark_town_Southampton'])
y_validate = validate.survived

X_test = test.drop(columns=['survived','sibsp','parch','alone','embark_town_Queenstown','embark_town_Southampton'])
y_test = test.survived

In [21]:
X_train.head()

     pclass        age      fare  sex_male
583       1  36.000000   40.1250         1
165       3   9.000000   20.5250         1
50        3   7.000000   39.6875         1
259       2  50.000000   26.0000         0
306       1  29.678105  110.8833         0

In [35]:
# initialize the model
logit2 = LogisticRegression(random_state=123)


logit2.fit(X_train, y_train)


y_pred = logit2.predict(X_train)

print("Baseline accuracy is", round(baseline_accuracy, 2))
print('Training accuracy: {:.2f}'
     .format(logit2.score(X_train, y_train)))

Baseline accuracy is 0.62
Training accuracy: 0.81

Nothing changed

Try out other combinations of features and models.

In [30]:
X_train = train.drop(columns=['survived','parch','alone','embark_town_Queenstown','baseline'])
y_train = train.survived

X_validate = validate.drop(columns=['survived','parch','alone','embark_town_Queenstown'])
y_validate = validate.survived

X_test = test.drop(columns=['survived','parch','alone','embark_town_Queenstown'])
y_test = test.survived

In [31]:
# initialize the model
logit3 = LogisticRegression(random_state=123)


logit3.fit(X_train, y_train)


y_pred = logit3.predict(X_train)

print("Baseline accuracy is", round(baseline_accuracy, 2))
print('Training accuracy: {:.2f}'
     .format(logit3.score(X_train, y_train)))

Baseline accuracy is 0.62
Training accuracy: 0.80

Use you best 3 models to predict and evaluate on your validate sample.

Choose you best model from the validation performation, and evaluate it on the test dataset. How do the performance metrics compare to validate? to train?